app/Controllers/DataAkun.php

    public function index()
    {
        // session();
        helper(['form']);
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

        $groupModel = new GroupModel();

        foreach ($data['users'] as $row) {
            $dataRow['group'] = $groupModel->getGroupsForUser($row->id);
            $dataRow['row'] = $row;
            $data['row' . $row->id] = view('data_akun/row', $dataRow);
        }

        $data['groups'] = $groupModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `auth_groups`