app/Controllers/Pelanggaran.php

INSERT INTO `pelanggaran` (`id_siswa`, `id_jenis`, `pelapor`, `catatan`, `waktu`, `foto_pelanggaran`) VALUES ('1', '3', 'Guru Kelas', 'Mencatat', 'Monday, 26 June 2023, 09:33:34 AM', '1687772037_5cc1b9c59cb2c341c708.png')
---
            $fileFoto->move('img', $namaFoto);
        }

        $this->pelanggaranModel->save([
            'id_siswa' => $this->request->getVar('id_siswa'),
            'id_jenis' => $this->request->getVar('id_jenis'),
            'pelapor' => $this->request->getVar('pelapor'),
            'catatan' => $this->request->getVar('catatan'),
            'waktu' => $this->request->getVar('waktu'),
            'foto_pelanggaran' => $namaFoto


        ]);