app/Controllers/Prestasi.php

DELETE FROM `prestasi`
WHERE `id_prestasi` IN ('2')
---
    public function delete($id_prestasi)
    {

        $this->prestasiModel->delete($id_prestasi);