app/Models/JenisModel.php

    public function joinJenis($id_jenis = false)
    {
        if ($id_jenis == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('jenis_pelanggaran');
            $builder->select('*');
            $builder->join('kategori_pelanggaran', 'kategori_pelanggaran.id_kategori = jenis_pelanggaran.id_kategori');
            $query = $builder->get();
---
SELECT *
FROM `jenis_pelanggaran`
JOIN `kategori_pelanggaran` ON `kategori_pelanggaran`.`id_kategori` = `jenis_pelanggaran`.`id_kategori`