app/Models/KelasModel.php

SELECT *
FROM `kelas`
---
    public function getKelas($id_kelas = false)
    {
        if ($id_kelas == false) {
            return $this->findAll();

SELECT COUNT(*) AS `numrows`
FROM `kelas`
---
    public function hitungJumlahKelas()
    {
        $db = \Config\Database::connect();
        $query = $db->table('kelas');
        $query->selectCount('id_kelas');
        $result = $query->countAllResults();