app/Models/LandingModel.php

    public function getLanding($id_setting = false)
    {
        if ($id_setting == false) {
            return $this->findAll();
        }
        return $this->where(['id_setting' => $id_setting])->first();
---
SELECT *
FROM `setting`
WHERE `id_setting` = 1
 LIMIT 1