app/Models/PelanggaranModel.php

SELECT COUNT(*) AS `numrows`
FROM `pelanggaran`
---
    public function hitungJumlahPelanggaran()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pelanggaran');
        $query->selectCount('id_pelanggaran');
        $result = $query->countAllResults();