app/Models/PelanggaranModel.php

    public function getPelanggaran($id_pelanggaran = false)
    {
        if ($id_pelanggaran == false) {
            return $this->findAll();
---
SELECT *
FROM `pelanggaran`

    public function joinPelanggaran($id_pelanggaran = false)
    {
        if ($id_pelanggaran == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('pelanggaran');
            $builder->select('*');
            $builder->join('siswa', 'siswa.id_siswa = pelanggaran.id_siswa');
            $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
            $builder->join('jenis_pelanggaran', 'jenis_pelanggaran.id_jenis = pelanggaran.id_jenis');
            $builder->join('kategori_pelanggaran', 'kategori_pelanggaran.id_kategori = jenis_pelanggaran.id_kategori');
            $builder->orderBy('pelanggaran.id_pelanggaran', 'ACS');
            $query = $builder->get();
---
SELECT *
FROM `pelanggaran`
JOIN `siswa` ON `siswa`.`id_siswa` = `pelanggaran`.`id_siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
JOIN `jenis_pelanggaran` ON `jenis_pelanggaran`.`id_jenis` = `pelanggaran`.`id_jenis`
JOIN `kategori_pelanggaran` ON `kategori_pelanggaran`.`id_kategori` = `jenis_pelanggaran`.`id_kategori`
ORDER BY `pelanggaran`.`id_pelanggaran`

    public function joinPelanggaranSumBobot($id_siswa)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('pelanggaran');
        $builder->selectSum('jenis_pelanggaran.bobot');
        $builder->join('siswa', 'siswa.id_siswa = pelanggaran.id_siswa');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $builder->join('jenis_pelanggaran', 'jenis_pelanggaran.id_jenis = pelanggaran.id_jenis');
        $builder->join('kategori_pelanggaran', 'kategori_pelanggaran.id_kategori = jenis_pelanggaran.id_kategori');
        $builder->where('pelanggaran.id_siswa', $id_siswa);
        $builder->orderBy('pelanggaran.id_pelanggaran', 'ACS');
        $query = $builder->get();
---
SELECT SUM(`jenis_pelanggaran`.`bobot`) AS `bobot`
FROM `pelanggaran`
JOIN `siswa` ON `siswa`.`id_siswa` = `pelanggaran`.`id_siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
JOIN `jenis_pelanggaran` ON `jenis_pelanggaran`.`id_jenis` = `pelanggaran`.`id_jenis`
JOIN `kategori_pelanggaran` ON `kategori_pelanggaran`.`id_kategori` = `jenis_pelanggaran`.`id_kategori`
WHERE `pelanggaran`.`id_siswa` = '19'
ORDER BY `pelanggaran`.`id_pelanggaran`

    public function joinPelanggaranLimit($limit)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('pelanggaran');
        $builder->select('*');
        $builder->join('siswa', 'siswa.id_siswa = pelanggaran.id_siswa');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $builder->join('jenis_pelanggaran', 'jenis_pelanggaran.id_jenis = pelanggaran.id_jenis');
        $builder->join('kategori_pelanggaran', 'kategori_pelanggaran.id_kategori = jenis_pelanggaran.id_kategori');
        $builder->orderBy('pelanggaran.id_pelanggaran', 'ACS');
        $builder->limit($limit);

        $query = $builder->get();
---
SELECT *
FROM `pelanggaran`
JOIN `siswa` ON `siswa`.`id_siswa` = `pelanggaran`.`id_siswa`
JOIN `kelas` ON `kelas`.`nama_kelas` = `siswa`.`id_kelas`
JOIN `jenis_pelanggaran` ON `jenis_pelanggaran`.`id_jenis` = `pelanggaran`.`id_jenis`
JOIN `kategori_pelanggaran` ON `kategori_pelanggaran`.`id_kategori` = `jenis_pelanggaran`.`id_kategori`
ORDER BY `pelanggaran`.`id_pelanggaran`
 LIMIT 3

    public function hitungJumlahPelanggaran()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pelanggaran');
        $query->selectCount('id_pelanggaran');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `pelanggaran`