app/Models/PrestasiModel.php

SELECT *
FROM `prestasi`
---
    public function getPrestasi($id_prestasi = false)
    {
        if ($id_prestasi == false) {
            return $this->findAll();

SELECT *
FROM `prestasi`
JOIN `siswa` ON `siswa`.`id_siswa` = `prestasi`.`id_siswa`
JOIN `kelas` ON `kelas`.`nama_kelas` = `siswa`.`id_kelas`
ORDER BY `prestasi`.`id_prestasi`
SELECT *
FROM `prestasi`
JOIN `siswa` ON `siswa`.`id_siswa` = `prestasi`.`id_siswa`
JOIN `kelas` ON `kelas`.`nama_kelas` = `siswa`.`id_kelas`
WHERE `id_prestasi` = '4'
ORDER BY `id_prestasi` DESC
---
    public function joinPrestasi($id_prestasi = false)
    {
        if ($id_prestasi == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('prestasi');
            $builder->select('*');
            $builder->join('siswa', 'siswa.id_siswa = prestasi.id_siswa');
            $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
            $builder->orderBy('prestasi.id_prestasi', 'ACS');
            $query = $builder->get();
            return $query->getResultArray();
        }
        $db      = \Config\Database::connect();
        $builder = $db->table('prestasi');
        $builder->select('*');
        $builder->join('siswa', 'siswa.id_siswa = prestasi.id_siswa');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $builder->where('id_prestasi', $id_prestasi);
        $builder->orderBy('prestasi.id_prestasi', 'ACS');
        $query = $builder->get();

SELECT *
FROM `prestasi`
JOIN `siswa` ON `siswa`.`id_siswa` = `prestasi`.`id_siswa`
JOIN `kelas` ON `kelas`.`nama_kelas` = `siswa`.`id_kelas`
ORDER BY `prestasi`.`id_prestasi`
 LIMIT 3
---
    public function joinPrestasiLimit($limit)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('prestasi');
        $builder->select('*');
        $builder->join('siswa', 'siswa.id_siswa = prestasi.id_siswa');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $builder->orderBy('prestasi.id_prestasi', 'ACS');
        $builder->limit($limit);
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `prestasi`
---
    public function hitungJumlahPrestasi()
    {
        $db = \Config\Database::connect();
        $query = $db->table('prestasi');
        $query->selectCount('id_prestasi');
        $result = $query->countAllResults();