app/Models/SiswaModel.php

SELECT *
FROM `siswa`
SELECT *
FROM `siswa`
WHERE `id_siswa` = '7'
 LIMIT 1
---
    public function getSiswa($id_siswa = false)
    {
        if ($id_siswa == false) {
            return $this->findAll();
        }
        return $this->where(['id_siswa' => $id_siswa])->first();

SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
ORDER BY `siswa`.`id_siswa` ASC
SELECT *
FROM `siswa`
JOIN `kelas` ON `kelas`.`id_kelas` = `siswa`.`id_kelas`
WHERE `id_siswa` = '7'
ORDER BY `siswa`.`id_siswa`
---
    public function joinSiswa($id_siswa = false)
    {
        if ($id_siswa == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('siswa');
            $builder->select('*');
            $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
            $builder->orderBy('siswa.id_siswa', 'ASC');
            $query = $builder->get();
            return $query->getResultArray();
        }
        $db      = \Config\Database::connect();
        $builder = $db->table('siswa');
        $builder->select('*');
        $builder->join('kelas', 'kelas.id_kelas = siswa.id_kelas');
        $builder->where('id_siswa', $id_siswa);
        $builder->orderBy('siswa.id_siswa', 'ACS');
        $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `siswa`
---
    public function hitungJumlahSiswa()
    {
        $db = \Config\Database::connect();
        $query = $db->table('siswa');
        $query->selectCount('id_siswa');
        $result = $query->countAllResults();